In [233]:
# Import Libraries and Dependencies
import pandas as pd

### 1. Combine and Clean the Data
#### Import CSVs

In [234]:
# Read the CSV files into DataFrames.
df_2020 = pd.read_csv("./Resources/athletic_sales_2020.csv")
df_2021 = pd.read_csv("./Resources/athletic_sales_2021.csv")

In [235]:
# Display the 2020 sales DataFrame
df_2020.head()

,retailer,retailer_id,invoice_date,region,state,city,product,price_per_unit,units_sold,total_sales,operating_profit,sales_method
0,Foot Locker,1185732,1/1/20,Northeast,New York,New York,Men's Street Footwear,50,1200,600000,300000.00,In-store
1,Foot Locker,1185732,1/1/20,Northeast,Pennsylvania,Philadelphia,Women's Apparel,68,83,5644,2426.92,Online
2,Foot Locker,1185732,1/1/20,Northeast,Pennsylvania,Philadelphia,Women's Apparel,75,275,206250,61875.00,Outlet
3,Foot Locker,1185732,1/1/20,Northeast,New York,New York,Men's Street Footwear,34,384,13056,6789.12,Outlet
4,Foot Locker,1185732,1/1/20,Northeast,Pennsylvania,Philadelphia,Women's Apparel,53,83,4399,1407.68,Outlet

In [236]:
# Display the 2021 sales DataFrame
df_2021.head()

,retailer,retailer_id,invoice_date,region,state,city,product,price_per_unit,units_sold,total_sales,operating_profit,sales_method
0,West Gear,1128299,1/1/21,West,California,San Francisco,Men's Athletic Footwear,65,750,487500,121875.00,Outlet
1,West Gear,1128299,1/1/21,West,California,San Francisco,Men's Athletic Footwear,51,233,11883,3208.41,Outlet
2,Kohl's,1189833,1/1/21,Midwest,Montana,Billings,Men's Apparel,50,275,137500,82500.00,Outlet
3,Kohl's,1189833,1/1/21,Midwest,Montana,Billings,Men's Apparel,47,77,3619,2714.25,Online
4,West Gear,1128299,1/1/21,West,California,San Francisco,Men's Athletic Footwear,64,225,14400,5184.00,Online

#### Check the data types of each DataFrame

In [237]:
# Check the 2020 sales data types.
df_2020.dtypes

retailer             object
retailer_id           int64
invoice_date         object
region               object
state                object
city                 object
product              object
price_per_unit        int64
units_sold            int64
total_sales           int64
operating_profit    float64
sales_method         object
dtype: object

In [238]:
# Check the 2021 sales data types.
df_2021.dtypes

retailer             object
retailer_id           int64
invoice_date         object
region               object
state                object
city                 object
product              object
price_per_unit        int64
units_sold            int64
total_sales           int64
operating_profit    float64
sales_method         object
dtype: object

#### Combine the sales data by rows.

In [239]:
# Combine the 2020 and 2021 sales DataFrames on the rows and reset the index.
combined_2020_2021_df = pd.concat([df_2020, df_2021], ignore_index=True)
combined_2020_2021_df.reset_index(drop=True, inplace=True)
combined_2020_2021_df.head()

,retailer,retailer_id,invoice_date,region,state,city,product,price_per_unit,units_sold,total_sales,operating_profit,sales_method
0,Foot Locker,1185732,1/1/20,Northeast,New York,New York,Men's Street Footwear,50,1200,600000,300000.00,In-store
1,Foot Locker,1185732,1/1/20,Northeast,Pennsylvania,Philadelphia,Women's Apparel,68,83,5644,2426.92,Online
2,Foot Locker,1185732,1/1/20,Northeast,Pennsylvania,Philadelphia,Women's Apparel,75,275,206250,61875.00,Outlet
3,Foot Locker,1185732,1/1/20,Northeast,New York,New York,Men's Street Footwear,34,384,13056,6789.12,Outlet
4,Foot Locker,1185732,1/1/20,Northeast,Pennsylvania,Philadelphia,Women's Apparel,53,83,4399,1407.68,Outlet

In [240]:
# Check if any values are null.
combined_2020_2021_df.isnull().sum()

retailer            0
retailer_id         0
invoice_date        0
region              0
state               0
city                0
product             0
price_per_unit      0
units_sold          0
total_sales         0
operating_profit    0
sales_method        0
dtype: int64

In [241]:
# Check the data type of each column
combined_2020_2021_df.dtypes

retailer             object
retailer_id           int64
invoice_date         object
region               object
state                object
city                 object
product              object
price_per_unit        int64
units_sold            int64
total_sales           int64
operating_profit    float64
sales_method         object
dtype: object

In [242]:
# Convert the "invoice_date" to a datetime datatype
combined_2020_2021_df["invoice_date"] = pd.to_datetime(combined_2020_2021_df["invoice_date"])
combined_2020_2021_df.head()

C:\Users\ogame\AppData\Local\Temp\ipykernel_412\1922543832.py:2: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  combined_2020_2021_df["invoice_date"] = pd.to_datetime(combined_2020_2021_df["invoice_date"])

,retailer,retailer_id,invoice_date,region,state,city,product,price_per_unit,units_sold,total_sales,operating_profit,sales_method
0,Foot Locker,1185732,2020-01-01,Northeast,New York,New York,Men's Street Footwear,50,1200,600000,300000.00,In-store
1,Foot Locker,1185732,2020-01-01,Northeast,Pennsylvania,Philadelphia,Women's Apparel,68,83,5644,2426.92,Online
2,Foot Locker,1185732,2020-01-01,Northeast,Pennsylvania,Philadelphia,Women's Apparel,75,275,206250,61875.00,Outlet
3,Foot Locker,1185732,2020-01-01,Northeast,New York,New York,Men's Street Footwear,34,384,13056,6789.12,Outlet
4,Foot Locker,1185732,2020-01-01,Northeast,Pennsylvania,Philadelphia,Women's Apparel,53,83,4399,1407.68,Outlet

In [223]:
# Confirm that the "invoice_date" data type has been changed.
combined_2020_2021_df.dtypes

retailer                    object
retailer_id                  int64
invoice_date        datetime64[ns]
region                      object
state                       object
city                        object
product                     object
price_per_unit               int64
units_sold                   int64
total_sales                  int64
operating_profit           float64
sales_method                object
dtype: object

### 2. Determine which Region Sold the Most Products

#### Using `groupby`

In [243]:
# Show the number products sold for region, state, and city.
# Rename the sum to "Total_Products_Sold".
total_products_sold = combined_2020_2021_df.groupby(["region", "state", "city"])['units_sold'].sum().reset_index()
total_products_sold.rename(columns={"units_sold":"Total_Products_Sold"}, inplace=True)
sort_top_5 = total_products_sold.sort_values(by="Total_Products_Sold", ascending=False)
# Show the top 5 results.
sort_top_5.head()

       region       state           city  Total_Products_Sold
21  Northeast    New York       New York               111954
33      South       Texas        Houston                90322
44       West  California  San Francisco                85478
43       West  California    Los Angeles                76384
34  Southeast     Florida          Miami                73135

#### Using `pivot_table`

In [244]:
# Show the number products sold for region, state, and city.
total_products_sold = pd.pivot_table(combined_2020_2021_df, index=["region", "state", "city"], values='units_sold', aggfunc="sum").reset_index()
# Rename the "units_sold" column to "Total_Products_Sold"
total_products_sold.rename(columns={"units_sold" : "Total_Products_Sold"},inplace=True)

# Show the top 5 results.
total_products_sold.head()

    region     state          city  Total_Products_Sold
0  Midwest  Illinois       Chicago                25407
1  Midwest   Indiana  Indianapolis                26332
2  Midwest      Iowa    Des Moines                23446
3  Midwest    Kansas       Wichita                29463
4  Midwest  Michigan       Detroit                50095

### 3. Determine which Region had the Most Sales

#### Using `groupby`

In [245]:
# Show the total sales for the products sold for each region, state, and city.
# Rename the "total_sales" column to "Total Sales"
total_sales = combined_2020_2021_df.groupby(["region", "state", "city"])["total_sales"].sum().reset_index()
total_sales.rename(columns={"total_sales":"Total_Sales"}, inplace=True)
region_sales = total_sales.sort_values(by="Total_Sales", ascending=False)
# Show the top 5 results.
region_sales.head()

       region           state           city  Total_Sales
21  Northeast        New York       New York     39801235
44       West      California  San Francisco     33973228
34  Southeast         Florida          Miami     31600863
39  Southeast  South Carolina     Charleston     29285637
35  Southeast         Florida        Orlando     27682851

#### Using `pivot_table`

In [246]:
# Show the total sales for the products sold for each region, state, and city.
total_sales = pd.pivot_table(combined_2020_2021_df, index=['region', 'state', 'city'], values="total_sales", aggfunc="sum").reset_index()

# Optional: Rename the "total_sales" column to "Total Sales"
total_sales.rename(columns={'total_sales' : 'Total_Sales'}, inplace=True)
region_sales = total_sales.sort_values(by='Total_Sales', ascending=False)
# Show the top 5 results.
region_sales.head()

       region           state           city  Total_Sales
21  Northeast        New York       New York     39801235
44       West      California  San Francisco     33973228
34  Southeast         Florida          Miami     31600863
39  Southeast  South Carolina     Charleston     29285637
35  Southeast         Florida        Orlando     27682851

### 4. Determine which Retailer had the Most Sales

#### Using `groupby`

In [247]:
# Show the total sales for the products sold for each retailer, region, state, and city.
# Rename the "total_sales" column to "Total Sales"
most_retail_sales = combined_2020_2021_df.groupby(['retailer', 'region', 'state', 'city']).agg({'total_sales' : 'sum'})
most_retail_sales.rename(columns={'total_sales' : 'Total_Sales'}, inplace=True)
# Show the top 5 results.
most_retail_sales = most_retail_sales.sort_values(by='Total_Sales', ascending=False)
most_retail_sales.head()

                                                    Total_Sales
retailer    region    state          city
West Gear   West      California     San Francisco     32794405
Kohl's      West      California     Los Angeles       25127160
Foot Locker Northeast New York       New York          25008568
West Gear   West      Washington     Seattle           24862675
Foot Locker Southeast South Carolina Charleston        24822280

#### Using `pivot_table`

In [248]:
# Show the total sales for the products sold for each retailer, region, state, and city.
pivot_table_retailer = pd.pivot_table(combined_2020_2021_df, index=['retailer', 'region', 'state', 'city'], values="total_sales", aggfunc="sum").reset_index()

# Optional: Rename the "total_sales" column to "Total Sales"
pivot_table_retailer.rename(columns={'total_sales' : 'Total_Sales'}, inplace=True)

# Show the top 5 results.
pivot_table_retailer.sort_values(by='Total_Sales', ascending=False).head()

        retailer     region           state           city  Total_Sales
103    West Gear       West      California  San Francisco     32794405
50        Kohl's       West      California    Los Angeles     25127160
22   Foot Locker  Northeast        New York       New York     25008568
109    West Gear       West      Washington        Seattle     24862675
33   Foot Locker  Southeast  South Carolina     Charleston     24822280

### 5. Determine which Retailer Sold the Most Women's Athletic Footwear

In [249]:
# Filter the sales data to get the women's athletic footwear sales data.
womens_footwear_data = combined_2020_2021_df[combined_2020_2021_df['product'] == "Womens's Athletic Footwear"]
womens_footwear_data.head()

Empty DataFrame
Columns: [retailer, retailer_id, invoice_date, region, state, city, product, price_per_unit, units_sold, total_sales, operating_profit, sales_method]
Index: []

#### Using `groupby`

In [250]:
# Show the total number of women's athletic footwear sold for each retailer, region, state, and city.
# Rename the "units_sold" column to "Womens_Footwear_Units_Sold"
total_womens_footwear = womens_footwear_data.groupby(['retailer', 'region', 'state', 'city']).agg({'units_sold' : 'sum'}).reset_index()
total_womens_footwear.rename(columns={'units_sold' : 'Womens_Footwear_Units_Sold'}, inplace=True)
# Show the top 5 results.
top_5_womens_shoes = total_womens_footwear.sort_values(by="Womens_Footwear_Units_Sold", ascending=False).head()
top_5_womens_shoes

Empty DataFrame
Columns: [retailer, region, state, city, Womens_Footwear_Units_Sold]
Index: []

#### Using `pivot_table`

In [251]:
# Show the total number of women's athletic footwear sold for each retailer, region, state, and city.
total_womens_footwear = pd.pivot_table(womens_footwear_data, index=['retailer', 'region', 'state', 'city'], values='units_sold', aggfunc='sum').reset_index()

# Rename the "units_sold" column to "Womens_Footwear_Units_Sold"
total_womens_footwear.rename(columns={'units_sold' : 'Womens_Footwear_Units_Sold'}, inplace=True)

# Show the top 5 results.
top_5_womens_shoes = total_womens_footwear.sort_values(by='Womens_Footwear_Units_Sold', ascending=False).head()
top_5_womens_shoes

KeyError: 'Womens_Footwear_Units_Sold'

### 6. Determine the Day with the Most Women's Athletic Footwear Sales

In [ ]:
# Create a pivot table with the 'invoice_date' column is the index, and the "total_sales" as the values.
total_womens_footwear = pd.pivot_table(womens_footwear_data, index='invoice_date', values='total_sales', aggfunc='sum')

# Optional: Rename the "total_sales" column to "Total Sales"
total_womens_footwear.rename(columns={'total_sales' : 'Total_Sales'}, inplace=True)

# Show the table.
total_womens_footwear.head()

Empty DataFrame
Columns: []
Index: []

In [ ]:
# Resample the pivot table into daily bins, and get the total sales for each day.
daily_sales = total_womens_footwear.resample('D').sum()

# Sort the resampled pivot table in descending order on "Total Sales".
daily_sales_sorted = daily_sales.sort_values(by='Total_Sales', ascending=False)
daily_sales_sorted.head()

KeyError: 'Total_Sales'

### 7.  Determine the Week with the Most Women's Athletic Footwear Sales

In [ ]:
# Resample the pivot table into weekly bins, and get the total sales for each week.
weekly_bin = total_womens_footwear.resample('W').sum()

# Sort the resampled pivot table in descending order on "Total Sales".
weekly_bin_total = weekly_bin.sort_values(by='Total_Sales', ascending=False)
weekly_bin_total.head()

KeyError: 'Total_Sales'